AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
/*******************************************************************************
* Function Name: ElfSymbolToAddr
****************************************************************************//**
* 
* This function is used to convert an ELF file symbol address to uint32_t. \n
* This is safer than casting a symbol address to an integer because the 
* function does not produce a MISRA warning at the call side.
* Also, a function call is more readable and easier to search with the text 
* editor.
*
* \param symbol The address of the ELF file symbol to get the uint32_t value for.
*
* \return The address of the ELF file symbol as uint32_t.
*
*******************************************************************************/
static uint32_t ElfSymbolToAddr(void volatile const *symbol)
{
    return (uint32_t) symbol;
}


/*******************************************************************************
* Function Name: Cy_DFU_GetAppMetadata
****************************************************************************//**
*
* Reads application metadata to \c verifyAddress and \c verifySize.
* The metadata is supposed to be located in internal Flash memory.
*
* This is a weak function and the user may override it in the user's code by 
* providing a function with the same name.
* This allows the user to place metadata in any NVM.
*
* \note It is assumed appId is a valid application number.
*
* \param appId          The application number.
* \param verifyAddress  The pointer to a variable where an application
*                       verified area start address is stored. 
* \param verifySize     The pointer to a variable where a size of verified  
*                       application area is stored.
*
* \return See \ref cy_en_dfu_status_t.
* 
*******************************************************************************/
__WEAK cy_en_dfu_status_t Cy_DFU_GetAppMetadata(uint32_t appId, uint32_t *verifyAddress, uint32_t *verifySize)
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS; 
    
    CY_ASSERT(appId < CY_DFU_MAX_APPS);
    
    uint32_t *ptr = (uint32_t*) ( ElfSymbolToAddr(&__cy_boot_metadata_addr) + (appId * METADATA_BYTES_PER_APP) );
    
    if (verifyAddress != NULL)
    {
        *verifyAddress = ptr[0];
    }
    if (verifySize != NULL)
    {
        *verifySize      = ptr[1];
    }

    return (status);
}


/* Use PDL Hardware Crypto API */
#if ((CY_DFU_OPT_CRYPTO_HW != 0) && (CY_DFU_APP_FORMAT == CY_DFU_BASIC_APP))
/*******************************************************************************
* Function Name: ComputeSha1
****************************************************************************//**
*
* This function computes SHA1 for the message.
*
* \note Ensure the Crypto block is properly initialized
* and \ref CY_DFU_OPT_CRYPTO_HW is set.
* 
* \param address    The pointer to a buffer containing data to compute
*                   the checksum for. \n
*                   It must be 4-byte aligned.
* \param length     The number of bytes in the buffer to compute SHA1 for.
* \param result     The pointer to a buffer to store the SHA1 output.
*                   It must be 4-byte aligned.
*
* \return
* - true  - If calculation is successful.
* - false - If calculation is unsuccessful.
* 
*******************************************************************************/
static bool ComputeSha1(uint32_t address, uint32_t length, uint8_t *result)
{

    cy_stc_crypto_context_sha_t cryptoShaContext;
    cy_en_crypto_status_t cryptoStatus;
    bool statusOk = true; 
    
    cryptoStatus = Cy_Crypto_Enable();
    if (cryptoStatus == CY_CRYPTO_SUCCESS)
    {
        cryptoStatus = Cy_Crypto_Sha_Run((uint32_t *)address, length, (uint32_t *)result, CY_CRYPTO_MODE_SHA1,
                                          &cryptoShaContext);
        if (cryptoStatus == CY_CRYPTO_SUCCESS)
        {
            /* Waiting for SHA1 calculation is finished. */
            cryptoStatus = Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
        }
        (void) Cy_Crypto_Disable();
    }
    if (cryptoStatus != CY_CRYPTO_SUCCESS)
    {
        statusOk = false;
    }
    return (statusOk);
}
#endif /* ((CY_DFU_OPT_CRYPTO_HW != 0) && (CY_DFU_APP_FORMAT == CY_DFU_BASIC_APP)) */


#if(CY_DFU_APP_FORMAT != CY_DFU_BASIC_APP)
#if(CY_DFU_SEC_APP_VERIFY_TYPE == CY_DFU_VERIFY_FAST)
/*******************************************************************************
* Function Name: VerifySecureAppShort
****************************************************************************//**
*
* This function reports whether or not the specified application is valid.
*
* \param verifyStartAddr The start address of the application to verify.
* \param verifyLength The length of the application to verify.
* \param signatureAddr The address of the application signature.
*
* \return
*       - true - If the application is valid.
*       - false - If the application is invalid
*
*******************************************************************************/
static bool VerifySecureAppShort(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr)
{
    uint32_t publicKeyAddr = ( (uint32_t)& SFLASH->PUBLIC_KEY[0] ) + PUBLIC_KEY_OFFSET;
    Cy_FB_VerifyApp_t Cy_FB_VerifyApp = (Cy_FB_VerifyApp_t) (*(uint32_t *) VERIFY_APP_TABLE_ADDR);
    return Cy_FB_VerifyApp(verifyStartAddr, verifyLength, signatureAddr, publicKeyAddr );
}


#else
/*******************************************************************************
* Function Name: VerifySecureAppFull
****************************************************************************//**
*
* This function reports whether or not the specified application, TOC, and key 
* are valid.
*
* \param verifyStartAddr The start address of the application to verify.
* \param verifyLength The length of the application to verify.
* \param signatureAddr The address of the application signature.
*
* \return
*       - true - If the application is valid.
*       - false - If the application is invalid.
*
*******************************************************************************/
static bool VerifySecureAppFull(uint32_t verifyStartAddr, uint32_t verifyLength, uint32_t signatureAddr)
{
    Cy_FB_ValidateToc_t Cy_FB_ValidateToc = (Cy_FB_ValidateToc_t) (*(uint32_t *) VALIDATE_TOC_TABLE_ADDR);
    Cy_FB_VerifyApp_t   Cy_FB_VerifyApp   = (Cy_FB_VerifyApp_t)   (*(uint32_t *) VERIFY_APP_TABLE_ADDR  );
    Cy_FB_IsValidKey_t  Cy_FB_IsValidKey  = (Cy_FB_IsValidKey_t)  (*(uint32_t *) IS_VALID_KEY_TABLE_ADDR);
    bool status = true;
    
    uint32_t tocAddr = Cy_FB_ValidateToc((uint32_t)& SFLASH->TOC2_OBJECT_SIZE);
    
    if ((tocAddr == TOC_EMPTY) || (tocAddr == TOC_INVALID))
    {
        status = false;
    }
    else
    {
        uint32_t publicKeyAddr = *(uint32_t *)(tocAddr + (sizeof(uint32_t) * PUBLIC_KEY_IDX))
                                + PUBLIC_KEY_OFFSET;
        status = Cy_FB_IsValidKey(tocAddr, publicKeyAddr);
        if (status)
        {
            status = Cy_FB_VerifyApp(verifyStartAddr, verifyLength, signatureAddr, publicKeyAddr );
        }
    }
    return (status);
}
#endif /* CY_DFU_SEC_APP_VERIFY_TYPE == CY_DFU_VERIFY_FAST */


