AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
/*******************************************************************************
* Function Name: SetPacketDSize
****************************************************************************//**
*
* This function is used to set a DFU packet size value.
*
* \param packet     The pointer to a byte array containing the 
*                   DFU packet data.
* \param size       The value for the DFU packet size.
*
*******************************************************************************/
static void SetPacketDSize(uint8_t packet[], uint32_t size)
{
    PutU16(packet, PACKET_SIZE_IDX, size);
}


/*******************************************************************************
* Function Name: SetPacketChecksum
****************************************************************************//**
*
* This function is used to set a DFU packet checksum value.
*
* \param packet     The pointer to a byte array containing the 
*                   DFU packet data.
* \param size       The DFU packet size value.
* \param checksum   The value for a DFU packet checksum.
*
*******************************************************************************/
static void SetPacketChecksum(uint8_t packet[], uint32_t size, uint32_t checksum)
{
    PutU16(packet, PacketChecksumIndex(size), checksum);
}


/*******************************************************************************
* Function Name: SetPacketFooter
****************************************************************************//**
*
* This function is used to set a DFU packet footer value.
*
* \param packet     The pointer to a byte array containing the
*                   DFU packet data.
* \param size       The DFU packet size value.
*
*******************************************************************************/
static void SetPacketFooter(uint8_t packet[], uint32_t size)
{
    packet[PacketEopIndex(size)] = PACKET_EOP_VALUE;
}


/*******************************************************************************
* Function Name: Cy_DFU_ValidateMetadata
****************************************************************************//**
*
* The function checks if the DFU metadata is valid.
*
* \return See \ref cy_en_dfu_status_t
* - \ref CY_DFU_SUCCESS - If metadata is valid.
* - \ref CY_DFU_ERROR_VERIFY - If metadata is not valid.
* 
*******************************************************************************/
cy_en_dfu_status_t Cy_DFU_ValidateMetadata(uint32_t metadataAddress, cy_stc_dfu_params_t *params)
{
    const uint32_t metadataLength = ElfSymbolToAddr(&__cy_boot_metadata_length);
    
    uint32_t crc = Cy_DFU_DataChecksum( (uint8_t *)metadataAddress, metadataLength - CRC_CHECKSUM_LENGTH, params);
    uint32_t crcMeta = *(uint32_t *)(metadataAddress + (metadataLength - CRC_CHECKSUM_LENGTH) );
    cy_en_dfu_status_t status = (crc == crcMeta) ? CY_DFU_SUCCESS : CY_DFU_ERROR_VERIFY;
    return (status);
}


/*******************************************************************************
* Function Name: PacketChecksum
****************************************************************************//**
*
* This function computes a 16-bit checksum for the provided number of bytes
* contained
* in the provided buffer. \n
* This function is used to calculate the checksum of DFU packets.
* 
* MISRA requires this function have no side effects.
*
* \param buffer     The buffer containing the data to compute the checksum for.
* \param size       The number of bytes in the buffer to compute the checksum
* for.
*
* \return A 16-bit checksum for the provided data
* 
*******************************************************************************/
static uint32_t PacketChecksum(const uint8_t buffer[], uint32_t size)
{
#if (CY_DFU_OPT_PACKET_CRC != 0u)
    uint16_t crc = CRC_CCITT_INIT;
    uint16_t tmp;
    uint32_t i;
    uint16_t tmpIndex;
    
    size += PACKET_DATA_IDX; /* 4 bytes before data in Cypress DFU packet */
    
    tmpIndex = (uint16_t)size;

    if(0u == size)
    {
        crc = ~crc;
    }
    else
    {
        do
        {
            tmp = buffer[tmpIndex - size];

            for (i = 0u; i < 8u; i++)
            {
                if (0u != ((crc & 0x0001u) ^ (tmp & 0x0001u)))
                {
                    crc = (crc >> 1u) ^ CRC_CCITT_POLYNOMIAL;
                }
                else
                {
                    crc >>= 1u;
                }

                tmp >>= 1u;
            }

            size--;
        }
        while(0u != size);

        crc = ~crc;
        tmp = crc;
        crc = ((uint16_t)(crc << 8u) | (tmp >> 8u) ) & 0xFFFFu;
    }

    return ((uint32_t)crc);
#else
    uint16_t sum = 0u;
    size += PACKET_DATA_IDX; /* 4 bytes before data in Cypress DFU packet */
    
    while (size > 0u)
    {
        size--;
        sum += buffer[size];
    }

    return ( (uint32_t) (  (1u + ~(uint32_t)sum) & 0xFFFFu  ) );
#endif /* CY_DFU_OPT_PACKET_CRC != 0u */
}


/*******************************************************************************
* Function Name: Cy_DFU_DataChecksum
****************************************************************************//**
*
* This function computes a CRC-32C for the provided number of bytes contained
* in the provided buffer. \n
* This function is used to validate the Program Data and Verify Data DFU
* commands and a metadata row.
* \note Ensure the Crypto block is properly initialized
* if \ref CY_DFU_OPT_CRYPTO_HW is set.
* 
* \param address    The pointer to a buffer containing the data to compute
*                   the checksum for.
* \param length     The number of bytes in the buffer to compute the checksum
*                   for.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return CRC-32C for the provided data.
* 
*******************************************************************************/
uint32_t Cy_DFU_DataChecksum(const uint8_t *address, uint32_t length, cy_stc_dfu_params_t *params)
{
#if CY_DFU_OPT_CRYPTO_HW != 0 /* Use PDL Hardware Crypto API */
    /* Note that the length will be < 64KB due to the hardware limitation in the Crypto Block. */
    /* If the block size is bigger, use software implementation instead. */

    
    
    uint32_t crcOut = 0u;
    /* Note: param is unused by the current implementation */
    /* but it may be used in the future, if the Crypto API changes */
    (void)params;
    
