AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
    cy_stc_crypto_context_crc_t cryptoCrcContext;
    cy_en_crypto_status_t cryptoStatus;
    
    cryptoStatus = Cy_Crypto_Enable();
    if (cryptoStatus == CY_CRYPTO_SUCCESS)
    {
        cryptoStatus = Cy_Crypto_Crc_Init( CRC_POLYNOMIAL,     CRC_DATA_REVERSE,
                                           CRC_DATA_XOR  ,     CRC_REM_REVERSE ,
                                           CRC_REM_XOR,        &cryptoCrcContext );
        if (cryptoStatus == CY_CRYPTO_SUCCESS)
        {
            cryptoStatus = Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
        }
        if (cryptoStatus == CY_CRYPTO_SUCCESS)
        {
            cryptoStatus = Cy_Crypto_Crc_Run (
                /* dataPtr */ (void *)address,          /* length        */ (uint16_t) length,
                /* crcPtr  */ &crcOut,                  /* lfsrInitState */ CRC_LFSR_SEED,
                /* cfContext     */ &cryptoCrcContext  );
        }
        if (cryptoStatus == CY_CRYPTO_SUCCESS)
        {
            cryptoStatus = Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
        }

        (void) Cy_Crypto_Disable();
    }
    if (cryptoStatus != CY_CRYPTO_SUCCESS)
    {
        Cy_SysLib_Halt(0x00u);
    }
    
    return (crcOut);
#else /* Use software implementation */
    /* Contains generated values to calculate CRC-32C by 4 bits per iteration*/
    const static uint32_t crcTable[CRC_TABLE_SIZE] = 
    {
        0x00000000u, 0x105ec76fu, 0x20bd8edeu, 0x30e349b1u,
        0x417b1dbcu, 0x5125dad3u, 0x61c69362u, 0x7198540du,
        0x82f63b78u, 0x92a8fc17u, 0xa24bb5a6u, 0xb21572c9u,
        0xc38d26c4u, 0xd3d3e1abu, 0xe330a81au, 0xf36e6f75u,
    };
    
    uint32_t crc = CRC_INIT;
    if (length != 0u)
    {
        do
        {
            crc = crc ^ *address;
            crc = (crc >> NIBBLE_POS) ^ crcTable[crc & NIBBLE_MSK];
            crc = (crc >> NIBBLE_POS) ^ crcTable[crc & NIBBLE_MSK];
            --length;
            ++address;
        } while (length != 0u);
    }
    return (~crc);
#endif /* CY_DFU_OPT_CRYPTO_HW != 0 */
}


/*******************************************************************************
* Function Name: VerifyPacket
****************************************************************************//**
*
* This function is used inside DFU_ReadVerifyPacket() to verify if a
* received packet is correct.
*
* \param numberRead     The number of bytes read from the communication
*                       interface.
* \param packet         The pointer to the DFU packet buffer.
*
* \return  See \ref cy_en_dfu_status_t.
*
*******************************************************************************/
static cy_en_dfu_status_t VerifyPacket(uint32_t numberRead, const uint8_t packet[])
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS;

    if ((numberRead < CY_DFU_PACKET_MIN_SIZE) || (packet[PACKET_SOP_IDX] != PACKET_SOP_VALUE))
    {
        status = CY_DFU_ERROR_DATA;
    }
    else
    {
        uint32_t packetSize = GetPacketDSize(packet);

        /*
         * If the whole packet length exceeds the number of bytes that have
         * been read by the communication component or the size of
         * the buffer that is reserved for the packet, then give an error.
         */
        if (   ((packetSize + CY_DFU_PACKET_MIN_SIZE) > numberRead)
            || ((packetSize + CY_DFU_PACKET_MIN_SIZE) > CY_DFU_SIZEOF_CMD_BUFFER)  )
        {
            status = CY_DFU_ERROR_LENGTH;
        }
        else /* The packet length is OK */
        {
            if ( ValidatePacketFooter(packet, packetSize) == 0u )
            {
                status = CY_DFU_ERROR_DATA;
            }
            else
            {
                uint32_t pktChecksum = GetPacketChecksum(packet, packetSize);
                if (pktChecksum != PacketChecksum(packet, packetSize) )
                {
                    status = CY_DFU_ERROR_CHECKSUM;
                }
            }
        }
    }
    return (status);
}


/*******************************************************************************
* Function Name: ReadVerifyPacket
****************************************************************************//**
*
* This function is used inside Cy_DFU_Continue to read and verify
* a received DFU packet.
*
* \param packet       The pointer to the DFU packet buffer.
* \param noResponse   The pointer to a variable that states whether to send
*                      a response back to a DFU Host or not.
* \param timeout      The timeout in milliseconds to wait.
*
* \return See \ref cy_en_dfu_status_t
* - \ref CY_DFU_SUCCESS - If a packet is successfully received.
* - \ref CY_DFU_ERROR_TIMEOUT - If no packet is received during
*   the timeout period.
* 
*******************************************************************************/
static cy_en_dfu_status_t ReadVerifyPacket(uint8_t packet[], bool *noResponse, uint32_t timeout)
{
    cy_en_dfu_status_t status;
    uint32_t numberRead = 0U;
    
    status = Cy_DFU_TransportRead( packet, CY_DFU_SIZEOF_CMD_BUFFER, &numberRead, timeout );

    if (status == CY_DFU_ERROR_TIMEOUT)
    {
        *noResponse = true;
    }
    if (status == CY_DFU_SUCCESS)
    {
        status = VerifyPacket(numberRead, packet);
    }
    return (status);
}


/*******************************************************************************
* Function Name: WritePacket
****************************************************************************//**
*
* This function creates a DFU response packet and transmits it back to
* the DFU host application over the already established communications
* protocol.
*
* \param status     The error response code of the DFU response packet.
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The number of bytes contained within the \c packet
*                   to pass back to a DFU Host.
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
static cy_en_dfu_status_t WritePacket(cy_en_dfu_status_t status, uint8_t *packet, uint32_t rspSize)
{
    uint32_t checksum;
    /*
    * The DFU Host expects only one byte of the status,
    * its value must be compatible with the PSoC 3/4/5LP Bootloader Component
    */
    uint32_t statusCode = (uint32_t)status & STATUS_BYTE_MSK;

    /* Build a packet */
    SetPacketHeader(packet);
    SetPacketCmd   (packet, statusCode);
    SetPacketDSize (packet, rspSize);

    checksum = PacketChecksum(packet, rspSize);
    SetPacketChecksum(packet, rspSize, checksum);
    SetPacketFooter  (packet, rspSize);

    return ( Cy_DFU_TransportWrite(packet, rspSize + CY_DFU_PACKET_MIN_SIZE, &rspSize, 
                                        TRANSPORT_WRITE_TIMEOUT));
}


/*******************************************************************************0
* Function Name: EnterResponse
****************************************************************************//**
*
* This function is used inside Cy_DFU_ContinueEntr() to add version and
* size fields.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param state      The pointer to a updating state variable.
*                   See \ref group_dfu_macro_state.
*
*******************************************************************************/
static void EnterResponse(uint8_t *packet, uint32_t *rspSize, uint32_t *state)
{
    static const cy_stc_dfu_enter_t dfuVersion =
    {
        CY_DFU_SILICON_ID,
        (uint8_t) CY_DFU_SILICON_REV,
        {
            (uint8_t) CY_DFU_SDK_VERSION_MINOR,
            (uint8_t) CY_DFU_SDK_VERSION_MAJOR,
            0x01u /* Used for BWC with the Bootloader component */
        }
    };
    *state = CY_DFU_STATE_UPDATING;
    *rspSize = sizeof(dfuVersion);
    (void) memcpy( GetPacketData(packet, PACKET_DATA_NO_OFFSET), &dfuVersion, *rspSize);
}


