AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
/*******************************************************************************
* Function Name: CommandEnter
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
*
* This function is called to handle Command Enter, see the DFU Commands
* section in the DFU SDK User's Guide.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param state      The pointer to a updating state variable.
*                   See \ref group_dfu_macro_state.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t.
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandEnter(uint8_t *packet, uint32_t *rspSize, uint32_t *state, 
                                            cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_LENGTH;
    volatile uint32_t productId = ElfSymbolToAddr(&__cy_product_id);
    uint32_t packetSize = GetPacketDSize(packet);
    *rspSize = CY_DFU_RSP_SIZE_0;
    
    if (packetSize == 0u)  /* 'Product ID' not demanded */
    {
        status = (productId == 0u)? CY_DFU_SUCCESS : CY_DFU_ERROR_LENGTH;
        if (status == CY_DFU_SUCCESS)
        {
            EnterResponse(packet, rspSize, state);
        }
    }
    else if ( (packetSize == DATA_PACKET_SIZE_4BYTES) || (packetSize == DATA_PACKET_SIZE_6BYTES) )
    {
        status = CY_DFU_ERROR_DATA;
        if (productId == GetU32(GetPacketData(packet, PACKET_DATA_NO_OFFSET) ) )
        {
            EnterResponse(packet, rspSize, state);
            status = CY_DFU_SUCCESS;
        }
    }
    else
    {
        /* Empty */
    }
    
    params->appId = params->appId; /* Remove the unused warning */

    return (status);
}


/*******************************************************************************
* Function Name: CopyToDataBuffer
****************************************************************************//**
*
* This is a helper function, called in the following functions:
* - DFU_CommandProgramData
* - CommandVerifyData
* - CommandSendData
*
* This is used to copy packet data to dataBuffer and increase dataOffset.
*
* \param dataBuffer     The pointer to a buffer containing the data to be
*                       written to an NVM.
* \param dataOffset     The offset within dataBuffer, indicates the current
*                       dataBuffer length.
* \param packet         The pointer to the DFU packet buffer.
* \param packetSize     The length in bytes of the data in the DFU
*                       packet buffer.
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
static cy_en_dfu_status_t CopyToDataBuffer(uint8_t dataBuffer[], uint32_t *dataOffset, uint8_t const packet[], 
                                                uint32_t packetSize)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_UNKNOWN;
    if ( (dataBuffer != NULL) && (dataOffset != NULL) && (packet != NULL) )
    {
        status = CY_DFU_ERROR_LENGTH;
        if ( (*dataOffset + packetSize) <= CY_DFU_SIZEOF_DATA_BUFFER )
        {
            status = CY_DFU_SUCCESS;
            (void) memcpy( &dataBuffer[*dataOffset], packet, packetSize);
            *dataOffset += packetSize;
        }
    }
    return (status);
}


/*******************************************************************************
* Function Name: CommandProgramData
****************************************************************************//**
*
* This a helper function for Cy_DFU_Continue().
* This function is used to program data to an NVM.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandProgramData(uint8_t  *packet, uint32_t *rspSize, cy_stc_dfu_params_t *params)
{   
    cy_en_dfu_status_t status = CY_DFU_ERROR_LENGTH;
    uint8_t  *dataBufferLocal =  params->dataBuffer;
    uint32_t *dataOffsetLocal = &params->dataOffset;
    uint32_t  packetSize =  GetPacketDSize(packet);

    *rspSize = CY_DFU_RSP_SIZE_0;
    if (packetSize >= PARAMS_SIZE)
    {
        uint32_t address =  GetU32( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        uint32_t crc = GetU32( GetPacketData(packet, PROGRAM_DATA_CRC_OFFSET) );

        /* Data may be sent with the Program Data DFU command, so copy it to dataBuffer */
        status = CopyToDataBuffer(dataBufferLocal, dataOffsetLocal, GetPacketData(packet, PARAMS_SIZE),
                                  packetSize - PARAMS_SIZE );
        
        if (status == CY_DFU_SUCCESS)
        {
            if (crc != Cy_DFU_DataChecksum(dataBufferLocal, *dataOffsetLocal, params) )
            {
                status = CY_DFU_ERROR_CHECKSUM;
            }
        }
        if (status == CY_DFU_SUCCESS)
        {
            status = Cy_DFU_WriteData(address, *dataOffsetLocal, CY_DFU_IOCTL_BHP, params);
        }
        if (status == CY_DFU_SUCCESS)
        {
            status = Cy_DFU_ReadData (address, *dataOffsetLocal, CY_DFU_IOCTL_COMPARE, params);
        }
    } /* if (packetSize >= PARAMS_SIZE) */
    *dataOffsetLocal = 0u;
    return (status);
}


#if CY_DFU_OPT_ERASE_DATA != 0
/*******************************************************************************
* Function Name: CommandEraseData
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
* This function erases an NVM row or page.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t.
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandEraseData(uint8_t  *packet, uint32_t *rspSize, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_LENGTH;
    *rspSize = CY_DFU_RSP_SIZE_0;
    if (GetPacketDSize(packet) == DATA_PACKET_SIZE_4BYTES)
    {
        uint32_t address = GetU32( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        status = Cy_DFU_WriteData(address, 0u, CY_DFU_IOCTL_ERASE, params);
    }
    params->dataOffset = 0u;
    return (status);
}
#endif /* CY_DFU_OPT_ERASE_DATA != 0 */


#if CY_DFU_OPT_VERIFY_DATA != 0
/*******************************************************************************
* Function Name: CommandVerifyData
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
* This function verifies an NVM row or page.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandVerifyData(uint8_t  *packet, uint32_t *rspSize, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status    = CY_DFU_ERROR_LENGTH;
    uint8_t  *dataBufferLocal =  params->dataBuffer;
    uint32_t *dataOffsetLocal = &params->dataOffset;

