AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
    uint32_t  packetSize = GetPacketDSize(packet);
    *rspSize = CY_DFU_RSP_SIZE_0;
    if (packetSize >= PARAMS_SIZE)
    {
        uint32_t address = GetU32( GetPacketData(packet, PACKET_DATA_NO_OFFSET) );
        uint32_t crc     = GetU32( GetPacketData(packet, VERIFY_DATA_CRC_OFFSET) );

        /* Data may be sent with the Program Data DFU command, so copy it to dataBuffer */
        status = CopyToDataBuffer(dataBufferLocal, dataOffsetLocal, GetPacketData(packet, PARAMS_SIZE),
                                  packetSize - PARAMS_SIZE );
        
        if (status == CY_DFU_SUCCESS)
        {
            if (crc != Cy_DFU_DataChecksum(dataBufferLocal, *dataOffsetLocal, params) )
            {
                status = CY_DFU_ERROR_CHECKSUM;
            }
        }

        if (status == CY_DFU_SUCCESS)
        {
            status = Cy_DFU_ReadData(address, *dataOffsetLocal, CY_DFU_IOCTL_COMPARE, params);
            status = (status == CY_DFU_SUCCESS) ? CY_DFU_SUCCESS : CY_DFU_ERROR_VERIFY;
        }
    }
    *dataOffsetLocal = 0u;
    return (status);
}
#endif /* CY_DFU_OPT_VERIFY_DATA != 0 */


#if CY_DFU_OPT_SEND_DATA != 0
/*******************************************************************************
* Function Name: CommandSendData
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
* This function handles the Send Data DFU command.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t.
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandSendData(uint8_t  *packet, uint32_t *rspSize, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status;
    uint32_t packetSize = GetPacketDSize(packet);
    uint8_t  *dataBufferLocal =  params->dataBuffer;
    uint32_t *dataOffsetLocal = &params->dataOffset;
    *rspSize = CY_DFU_RSP_SIZE_0;
    
    /* Data may be sent with the Program Data DFU command, so copy it to dataBuffer */
    status = CopyToDataBuffer(dataBufferLocal, dataOffsetLocal, 
                                GetPacketData(packet, PACKET_DATA_NO_OFFSET), 
                                packetSize);
    
    return (status);
}
#endif /* CY_DFU_OPT_SEND_DATA != 0 */


#if CY_DFU_OPT_VERIFY_APP != 0
/*******************************************************************************
* Function Name: CommandVerifyApp
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
* This function handles the Verify Application DFU command.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t.
* 
*******************************************************************************/
static cy_en_dfu_status_t CommandVerifyApp(uint8_t *packet, uint32_t *rspSize, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status  = CY_DFU_ERROR_LENGTH;
    uint32_t packetSize = GetPacketDSize(packet);
    *rspSize = CY_DFU_RSP_SIZE_0;
    

    if ( (packetSize == sizeof(uint32_t) ) || (packetSize == VERIFY_APP_DATA_SIZE) )
    {
        uint32_t app = (uint32_t) *GetPacketData(packet,PACKET_DATA_NO_OFFSET);
        if (app < CY_DFU_MAX_APPS)
        {
            status = Cy_DFU_ValidateApp(app, params);
        }
        else
        {
            status = CY_DFU_ERROR_VERIFY;
        }
    }

    if ( (status == CY_DFU_SUCCESS) || (status == CY_DFU_ERROR_VERIFY) )
    {
        uint8_t *valid = GetPacketData(packet, PACKET_DATA_NO_OFFSET);
        *valid = (status == CY_DFU_SUCCESS) ? 1u : 0u;
        status = CY_DFU_SUCCESS;
        *rspSize = CY_DFU_RSP_SIZE_VERIFY_APP;
    }
    return (status);
}
#endif /* CY_DFU_OPT_VERIFY_APP != 0 */

#if CY_DFU_METADATA_WRITABLE != 0
/*******************************************************************************
* Function Name: Cy_DFU_SetAppMetadata
****************************************************************************//**
*
* This is a helper function for Cy_DFU_Continue().
* This function sets application metadata and updates a metadata checksum.
* \note If the application metadata is the same as already
* present in the NVM, then the NVM is not rewritten and this function only exits.
* \note This function uses params->dataBuffer for the read and write NVM.
*
* \param appId           The application number to update metadata for.
* \param verifyAddress   An application verified area start address   
* \param verifySize      The size of verified application area
* \param params          The pointer to a DFU parameters structure.
*                        See \ref cy_stc_dfu_params_t.
* 
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
cy_en_dfu_status_t Cy_DFU_SetAppMetadata(uint32_t appId, uint32_t verifyAddress, uint32_t verifySize, 
                                                   cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS;
    uint32_t metadataAddress = 0u;
    uint32_t metadataLength  = 0u;
    if ((params == NULL) || (appId >= CY_DFU_MAX_APPS))
    {
        status = CY_DFU_ERROR_UNKNOWN;
    }
    if (status == CY_DFU_SUCCESS)
    {
        metadataAddress = ElfSymbolToAddr(&__cy_boot_metadata_addr  );
        metadataLength  = ElfSymbolToAddr(&__cy_boot_metadata_length);
        status = Cy_DFU_ReadData(metadataAddress, metadataLength, CY_DFU_IOCTL_READ, params);
    }
    if (status == CY_DFU_SUCCESS)
    {    
        uint32_t getVerifyAddress = GetU32(params->dataBuffer + (appId * METADATA_BYTES_PER_APP));
        uint32_t getVerifySize      = GetU32(params->dataBuffer + (appId * METADATA_BYTES_PER_APP) + 
                                            METADATA_APP_LENGTH_OFFSET);
        if ( (getVerifyAddress != verifyAddress) || ( getVerifySize != verifySize) )
        {
            uint32_t crc;
            PutU32(params->dataBuffer, (appId * METADATA_BYTES_PER_APP)     , verifyAddress);
            PutU32(params->dataBuffer, (appId * METADATA_BYTES_PER_APP) + METADATA_APP_LENGTH_OFFSET, verifySize);
            crc = Cy_DFU_DataChecksum(params->dataBuffer, metadataLength - CRC_CHECKSUM_LENGTH, params);
            PutU32(params->dataBuffer, metadataLength - CRC_CHECKSUM_LENGTH, crc);
            status = Cy_DFU_WriteData(metadataAddress, metadataLength, CY_DFU_IOCTL_WRITE, params);
        }
    }
    return (status);
}
#endif /* CY_DFU_METADATA_WRITABLE != 0 */


