AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.c
    /* To remove the compiler warnings */
    (void)packet;
    params->dataOffset = 0u;

    *rspSize = CY_DFU_RSP_SIZE_0;
    return (status);
}


/*******************************************************************************
* Function Name: ContinueHelper
****************************************************************************//**
* This is a helper function for Cy_DFU_Continue(). This function parses
*  most of the DFU commands.
*
* \param packet     The pointer to the DFU packet buffer.
* \param rspSize    The pointer to a response packet size.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t .
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
static cy_en_dfu_status_t ContinueHelper(uint32_t command, uint8_t *packet, uint32_t *rspSize,
                                              cy_stc_dfu_params_t *params, bool *noResponse)
{
    /* Set to a close warning (status may be used uninitialized)*/
    cy_en_dfu_status_t status = CY_DFU_ERROR_UNKNOWN; 
    switch (command)
    {
    case CY_DFU_CMD_PROGRAM_DATA:
        status = CommandProgramData(packet, rspSize, params);
        break;

#if CY_DFU_OPT_VERIFY_DATA != 0
    case CY_DFU_CMD_VERIFY_DATA:
        status = CommandVerifyData(packet, rspSize, params);
        break;
#endif /* CY_DFU_OPT_VERIFY_DATA != 0 */

#if CY_DFU_OPT_ERASE_DATA != 0
    case CY_DFU_CMD_ERASE_DATA:
        status = CommandEraseData(packet, rspSize, params);
        break;
#endif /* CY_DFU_OPT_ERASE_DATA != 0 */

#if CY_DFU_OPT_VERIFY_APP != 0
    case CY_DFU_CMD_VERIFY_APP:
        status = CommandVerifyApp(packet, rspSize, params);
        break;
#endif /* CY_DFU_OPT_VERIFY_APP != 0 */

#if CY_DFU_OPT_SEND_DATA != 0
    case CY_DFU_CMD_SEND_DATA_WR:
        *noResponse = true;
        status = CommandSendData(packet, rspSize, params);
        break;
        
    case CY_DFU_CMD_SEND_DATA:
        status = CommandSendData(packet, rspSize, params);
        break;
#endif /* CY_DFU_NO_CMD_SEND_DATA == 0 */

    case CY_DFU_CMD_SYNC: /* If something fails, then the Host sends this command to reset the DFU */
        params->dataOffset = 0u;
        *noResponse = true;
        break;

    case CY_DFU_CMD_SET_APP_META:
        status = CommandSetAppMetadata(packet, rspSize, params);
        break;

#if CY_DFU_OPT_GET_METADATA != 0
    case CY_DFU_CMD_GET_METADATA:
        status = CommandGetMetadata(packet, rspSize, params);
        break;
#endif /* CY_DFU_OPT_GET_METADATA != 0 */

#if CY_DFU_OPT_SET_EIVECTOR != 0
    case CY_DFU_CMD_SET_EIVECTOR:
        status = CommandSetEIVector(packet, rspSize, params);
        break;
#endif /* CY_DFU_OPT_SET_EIVECTOR != 0 */

    default:
        status = CommandUnsupported(packet, rspSize, params);
        break;
    } /* switch (command) */
    return (status);
}


/*******************************************************************************
* Function Name: Cy_DFU_Continue
****************************************************************************//**
*
* This function causes the DFU to attempt to read data being transmitted
* by the Host application.  If data is sent from the Host, this establishes the
* communication interface to process all requests.
*
* \param state      The pointer to a updating state variable.
*                   See \ref group_dfu_macro_state.
* \param params     The pointer to a DFU parameters structure.
*                   See \ref cy_stc_dfu_params_t.
*
* \return See \ref cy_en_dfu_status_t
* 
*******************************************************************************/
cy_en_dfu_status_t Cy_DFU_Continue(uint32_t *state, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_UNKNOWN; /* Give a value to a close warning */
    uint8_t *packet = params->packetBuffer; /* Receive/Transmit buffer */  

    uint32_t rspSize = CY_DFU_RSP_SIZE_0;
    bool noResponse = false;        /* Indicates whether to send a response packet back to the Host */

    CY_ASSERT(params->timeout != 0u);
    CY_ASSERT(params->dataBuffer != NULL);
    CY_ASSERT(params->packetBuffer != 0);

    
    if ( (*state == CY_DFU_STATE_NONE) || (*state == CY_DFU_STATE_UPDATING) )
    {
        status = ReadVerifyPacket(packet, &noResponse, params->timeout);
        if (status == CY_DFU_SUCCESS)
        {
            uint32_t command = GetPacketCommand(packet);

            if      (command == CY_DFU_CMD_ENTER)
            {
                status = CommandEnter(packet, &rspSize, state, params);
            }
            else if (command == CY_DFU_CMD_EXIT)
            {
                *state = CY_DFU_STATE_FINISHED;
                noResponse = true;
            }
            else if (*state != CY_DFU_STATE_UPDATING)
            {
                status = CY_DFU_ERROR_CMD;
            }
            else
            {
                status = ContinueHelper(command, packet, &rspSize, params, &noResponse);
            }
        }

        if (!noResponse)
        {
            (void) WritePacket(status, packet, rspSize);
        }
    }
    else
    {
        /* empty */
    }
    return (status);
}


/* [] END OF FILE */
